{
  "arxiv_id": "2104.09369v1",
  "title": "Adversarial Diffusion Attacks on Graph-based Traffic Prediction Models",
  "authors": [
    "Lyuyi Zhu",
    "Kairui Feng",
    "Ziyuan Pu",
    "Wei Ma"
  ],
  "summary": "Real-time traffic prediction models play a pivotal role in smart mobility systems and have been widely used in route guidance, emerging mobility services, and advanced traffic management systems. With the availability of massive traffic data, neural network-based deep learning methods, especially the graph convolutional networks (GCN) have demonstrated outstanding performance in mining spatio-temporal information and achieving high prediction accuracy. Recent studies reveal the vulnerability of GCN under adversarial attacks, while there is a lack of studies to understand the vulnerability issues of the GCN-based traffic prediction models. Given this, this paper proposes a new task -- diffusion attack, to study the robustness of GCN-based traffic prediction models. The diffusion attack aims to select and attack a small set of nodes to degrade the performance of the entire prediction model. To conduct the diffusion attack, we propose a novel attack algorithm, which consists of two major components: 1) approximating the gradient of the black-box prediction model with Simultaneous Perturbation Stochastic Approximation (SPSA); 2) adapting the knapsack greedy algorithm to select the attack nodes. The proposed algorithm is examined with three GCN-based traffic prediction models: St-Gcn, T-Gcn, and A3t-Gcn on two cities. The proposed algorithm demonstrates high efficiency in the adversarial attack tasks under various scenarios, and it can still generate adversarial samples under the drop regularization such as DropOut, DropNode, and DropEdge. The research outcomes could help to improve the robustness of the GCN-based traffic prediction models and better protect the smart mobility systems. Our code is available at https://github.com/LYZ98/Adversarial-Diffusion-Attacks-on-Graph-based-Traffic-Prediction-Models",
  "published": "2021-04-19T14:57:25+00:00",
  "updated": "2021-04-19T14:57:25+00:00",
  "categories": [
    "cs.LG",
    "cs.AI"
  ],
  "topic": "diffusion",
  "pdf_path": "data\\pdfs\\2104.09369v1.pdf",
  "arxiv_url": "http://arxiv.org/abs/2104.09369v1"
}