{
  "arxiv_id": "2104.04430v1",
  "title": "Ice Core Science Meets Computer Vision: Challenges and Perspectives",
  "authors": [
    "P. Bohleber",
    "M. Roman",
    "C. Barbante",
    "S. Vascon",
    "K. Siddiqi",
    "M. Pelillo"
  ],
  "summary": "Polar ice cores play a central role in studies of the earth's climate system through natural archives. A pressing issue is the analysis of the oldest, highly thinned ice core sections, where the identification of paleoclimate signals is particularly challenging. For this, state-of-the-art imaging by laser-ablation inductively-coupled plasma mass spectrometry (LA-ICP-MS) has the potential to be revolutionary due to its combination of micron-scale 2D chemical information with visual features. However, the quantitative study of record preservation in chemical images raises new questions that call for the expertise of the computer vision community. To illustrate this new inter-disciplinary frontier, we describe a selected set of key questions. One critical task is to assess the paleoclimate significance of single line profiles along the main core axis, which we show is a scale-dependent problem for which advanced image analysis methods are critical. Another important issue is the evaluation of post-depositional layer changes, for which the chemical images provide rich information. Accordingly, the time is ripe to begin an intensified exchange among the two scientific communities of computer vision and ice core science. The collaborative building of a new framework for investigating high-resolution chemical images with automated image analysis techniques will also benefit the already wide-spread application of LA-ICP-MS chemical imaging in the geosciences.",
  "published": "2021-04-09T15:27:44+00:00",
  "updated": "2021-04-09T15:27:44+00:00",
  "categories": [
    "cs.CV",
    "physics.geo-ph"
  ],
  "topic": "computer_vision",
  "pdf_path": "data\\pdfs\\2104.04430v1.pdf",
  "arxiv_url": "http://arxiv.org/abs/2104.04430v1"
}